import random

def get_prediction():
    responses = [
        "Бесспорно",
        "Предрешено",
        "Никаких сомнений",
        "Определённо да",
        "Можешь быть уверен в этом",
        "Мне кажется — да",
        "Вероятнее всего",
        "Хорошие перспективы",
        "Знаки говорят — да",
        "Да",
        "Пока не ясно, попробуй снова",
        "Спроси позже",
        "Лучше не рассказывать",
        "Сейчас нельзя предсказать",
        "Сконцентрируйся и спроси опять",
        "Даже не думай",
        "Мой ответ — нет",
        "По моим данным — нет",
        "Перспективы не очень хорошие",
        "Весьма сомнительно"
    ]
    return random.choice(responses)

def magic_8_ball():
    print("Добро пожаловать в 'Волшебный шар предсказаний'!")
    print("Задай вопрос, и я дам ответ на него.")
    
    while True:
        question = input("Задай свой вопрос (или введи 'выход' для завершения игры): ")
        if question.lower() == 'выход':
            break
        else:
            prediction = get_prediction()
            print(f"Волшебный шар говорит: {prediction}")

magic_8_ball()
